package sticker

import "strings"

var stickerMap = map[string]string{
	"повыс":       "📈",
	"рост":        "📈",
	"повыш":       "📈",
	"русолово":    "🏭",
	"производ":    "🏭",
	"промышлен":   "🏭",
	"globaltrak":  "🚘",
	"автомобил":   "🚘",
	"транспорт":   "🚘",
	"селигдар":    "🥇",
	"отчитал":     "📖",
	"газ":         "🛢",
	"нефт":        "🛢",
	"топлив":      "🛢",
	"ресурс":      "🛢",
	"fix price":   "🛍",
	"прода":       "💸",
	"доля":        "💸",
	"выручк":      "💸",
	"деньг":       "💸",
	"денеж":       "💰",
	"дивиденд":    "💰",
	"отчет":       "📖",
	"магазин":     "🏪",
	"вырос":       "📈",
	"увелич":      "📈",
	"уменьш":      "📉",
	"обвал":       "📉",
	"пад":         "📉",
	"вниз":        "📉",
	"вверх":       "📈",
	"даркстор":    "🛍",
	"одобр":       "✅",
	"подтвер":     "✅",
	"гендиректор": "👨‍🏫",
	"глав":        "👨‍🏫",
	"президент":   "👨‍🏫",
	"управляющ":   "👨‍🏫",
	"правлен":     "👨‍🏫",
	"акци":        "💼",
	"бизнес":      "💼",
}

func GetStickerByText(text string) string {
	text = strings.ToLower(text)
	for word, sticker := range stickerMap {
		if strings.Contains(text, word) {
			return sticker
		}
	}
	return ""
}
